# 1. Введите класс
# 2. Введите предмет
# 3. Отображается весь список учеников (как вариант с отметками)
# 4. Пункт "Кого вызвать?"
# 5. Пункт "На какую оценку ответил ученик?"
#
# 7B.txt
# {предмет: {ученик:[5,5,5,5,4], ученик:[5,5,5,5,], ученик:[5,5,5,5,]}}
# {имя ученика: {предмет:[5,5,5,5,], предмет:[5,5,5,5,], предмет:[5,5,5,5,]}}
# {имя ученика: {предмет:[5,5,5,5,], предмет:[5,5,5,5,], предмет:[5,5,5,5,]}}
# {имя ученика: {предмет:[5,5,5,5,], предмет:[5,5,5,5,], предмет:[5,5,5,5,]}}
# {имя ученика: {предмет:[5,5,5,5,], предмет:[5,5,5,5,], предмет:[5,5,5,5,]}}

import controller

controller.start()
