# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

my_list = [2, 3, 4, 5, 6]
res = []
middle = (len(my_list) + 1) // 2

for i in range(middle):
    left = my_list[i]
    right = my_list[-i - 1]
    res.append(left * right)

print(res)
